{
    "author": "Culture Numérique",
    "css": "http://culturenumerique.univ-lille3.fr/css/base.css",
    "ims_archive_path": "",
    "language": "fr",
    "menutitle": "Module 1",
    "module": "module1",
    "sections": [
        {
            "lastLine": "",
            "module": "module1",
            "num": "1",
            "subsections": [
                {
                    "filename": "1-1syntaxe-pour-editer-un-contenu-de-cours-esc-pad_webcontent.html",
                    "folder": "webcontent",
                    "lastLine": "## Comment ajouter des sous-sections `Activités`\n",
                    "num": "1-1",
                    "src": "\n[video]( https://player.vimeo.com/video/93350435 ){: .lien_video } \n\nNous détaillons ici la chaine éditoriale adoptée pour la production des modules mis à dispositions sur ce dépôt.  \nNous utilisons un fichier dit \"maitre\" comme matrice de base pour générer le cours. La syntaxe employée est basée sur le format **MarkDown**. Vous pourrez observer l'usage de ce format dans la video de cette section de cours. \n\nPour permettre de prendre en compte les spécificités d'un contenu de cours destiné à être publié en ligne ou au sein de plateforme de Mooc ou de eLearning, nous avons étendu la syntaxe Markdown. Ces ajouts consistent en des conventions décrites ci-dessous et reprennent également les extensions proposées par la [librairie Python de MarkDown](https://pythonhosted.org/Markdown/extensions). \n\n### Structure globale d'un cours Culture Numérique\nUn cours se décompose en sections et sous-sections. Le niveau sous-sections constitue le niveau \"pivot\" de la structure d'un cours Culture NUmérique. Chaque sous-section peut être du type et de la forme suivante:  \n\n1. élément de cours simple (texte + images)  \n2. élément de cours incluant une ou plusieurs animations (vidéo) accompagnées à chaque fois par la version texte lisible en mode _zen_ \n1. auto-évaluation sous forme de quiz \n2. exercice d'approfondissement incluant un énoncé (texte riche) et un espace pour fournir une réponse sous forme de texte libre\n\n### Sous-section de cours simple\n\nRédigée en MarkDown, c'est un type de sous-section simple consistant en du texte mis en forme et enrichi d'images. \nPar rapport au MArkdown simple, nous utilisons les fonctions supplémentaires décrites ci-après.\n\n#### ajouter des classes CSS \n\nAvec des [Attribute list](https://pythonhosted.org/Markdown/extensions/attr_list.html): Pour permettre d'ajouter des classes CSS à une image ou à un bloc de texte, pour permettre une mise en page enrichie.\nUn exemple pour ajouter un attribut en ligne à un lien:  \n`[link](http://example.com){: class=\"foo bar\" .titre title=\"Some title!\" }`  \nqui produit le HTML suivant:  \n`<p><a href=\"http://example.com\" class=\"foo bar titre\" title=\"Some title!\">link</a></p>`  \n\nNotez que pour ajouter des classes on peut soit spécifier `.une_classe` ou `class='une_classe``\n\n#### Commentaires invisibles\nEn utilisant simplement les commentaires HTML:\n    \n        <!-- On pourrait aussi mentionner les lol cats dans cette section non ? -->\n\nLe commentaire suivant ne sera donc pas visible dans le rendu HTML final.\n<!-- Il faudrait vraiment enrichir cette documentation de quelques Gifs animés -->        \n\n### Sous-section de cours avec animations vidéo\nCes éléments de cours consistent en des sous-sections pouvant inclure 1 ou plusieurs vidéos d'animations. Ici il y a 2 étapes:  \n- a) avant la réalisation des vidéos, on ajoute des blocs 'Idée animation' pour décrire ce que pourrait contenir l'animation qui sera intégrée par la suite\n- b) une fois la vidéo réalisée, on intègre le lien de la vidéo qui sera ensuite intégrée via une iframe dans la sous-section de cours\n\n####a) Notes pour idées d'animation\nOn utilise ici le principe natif de block quote Markdown avec un `>` en début de paragraphe:\n```    \n> [Animation] Peut être des lettres simples en suite de 0 et de 1, et des\ncompositions en mots/composition de suites de 0 et 1...  est-ce\nqu'on fait passer l'idée de coder/décoder et sa contraction en codec?  \n```\nQui produira ce résultat:\n\n> [Animation] Peut être des lettres simples en suite de 0 et de 1, et des\ncompositions en mots/composition de suites de 0 et 1...  est-ce\nqu'on fait passer l'idée de coder/décoder et sa contraction en codec?  \n\n**NB** Si le mot clé `[Animation]` n'est pas inclu, le bloc sera toujours interprété comme bloc idée d'animation.\n\n####b) Lien vers une vidéo d'animation\nSur le même principe que les *attribute lists* (cf ci-dessus), on spécifie qu'il s'agit d'un lien vers une vidéo en spécifiant la classe `lien_video`:  \n\n```\n    [Introduction au web](https://player.vimeo.com/video/138623497){: .lien_video } \n\nou  \n\n    [Introduction au web](https://player.vimeo.com/video/138623497){: class=\"lien_video\" } \n```\n\nCe lien doit être placé à l'intérieur d'une sous-section. Une sous-section peut bien sûr comporter plusieurs vidéos. \n\nCes liens vidéos font l'objet d'un traitement spécifique selon le type d'export:\n* export Site Vitrine HTML: on génère un code d'iframe qui permet de lire le/les vidéo/s sans quitter la page courante; le texte de la sous-section est quant à lui offert en parallèle en mode \"zen\" activé au click sur la vignette à côté des vidéos (cf image ci-dessous).\n![video_site_vitrine](media/vue_web_cours.png)\n* pour l'export Moodle/IMSCC, le lien est simplement reformaté pour respecter le format `http://vimeo.com/video_id` qui permet au plugin Viméo de Moodle de transformer le lien vidéo en iframe automatiquement:\n![video_moodle](media/3.vue_cours_avec_video.png)\n\n\n\n",
                    "title": "Syntaxe pour éditer un contenu de cours Esc@Pad",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/93350435",
                            "video_thumbnail": "https://i.vimeocdn.com/video/536038298_640.jpg",
                            "video_title": "video"
                        }
                    ]
                },
                {
                    "filename": "1-2comment-ajouter-des-sous-sections-activites_webcontent.html",
                    "folder": "webcontent",
                    "lastLine": "## Exemples d'activité\n",
                    "num": "1-2",
                    "src": "\nLes activités peuvent être de 2 types:\n\n- auto-évaluation: `activité`\n- Exercices d'approfondissement: `activité-avancée`\nPour le découpage des activités, nous n'utilisons plus les `##` de la syntaxe markdown, mais les \"fenced code blocks\" en spécifiant le type d'activité  juste à côté des \"backticks\" ````activité`\n\n### Syntaxe GIFT\n\nCes activités sont rédigées en GIFT; chaque question est séparée par une ligne vide. La syntaxe Gift a été proposé par l'équipde Moodle pour permettre de gagner du temps dans la rédaction de quizz et de tests. Cette syntaxe est disponible sur [cette page](https://docs.moodle.org/28/en/GIFT_format). Il s'agit d'un format \"texte\" qui peut s'éditer dans n'importe quel \"éditeur de texte\" (et non dans un \"traitement de texte\").\n \nExemple:\n\n        ```activité-avancée\n        \n        ::La représentation numérique d'un livre peut inclure des données qui ne se limitent pas au texte. Donnez quelques exemples:: {\n        #### Le genre, la date de création, ...\n        }\n        \n        ::Fonctionnalités d'un éditeur de textes::\n        [html]<p>Parmi les  fonctionnalités suivantes, lesquelles sont possibles ?\n        </p>\n        {\n        ~%25%copier/couper/coller#tous les éditeurs le permettent\n        ~%25%rechercher et remplacer#très souvent disponible\n        ~%25%avancer de mots en mots#souvent par la conjonction CRTL-flèches\n        ~%25%corriger l'orthographe#certains le font\n        ~%-100%mettre en gras#l'éditeur ne permet pas d'enregistrer des mises en forme (il est possible toutefois d'écrire des commandes de mise en forme : un mot n'est pas en gras mais un texte dans un langage peut exprimer l'ordre de mettre en gras)\n        }\n        ```\n\n\n \n",
                    "title": "Comment ajouter des sous-sections `Activités`",
                    "videos": []
                },
                {
                    "filename": "1-3exemples-d-activite_webcontent.html",
                    "folder": "webcontent",
                    "lastLine": "```comprehension\n",
                    "num": "1-3",
                    "src": "\nDans les sous-sections suivantes, retrouvez une série d'exemple d'activités des 2 types (simple et avancées.). N'hésitez-pas à vous inspirer de ces exemples et à les prendre comme point de départ pour créer vos propres contenus.\n\n",
                    "title": "Exemples d'activité",
                    "videos": []
                },
                {
                    "filename": "1-4auto-evaluation_Comprehension.html",
                    "folder": "Comprehension",
                    "lastLine": "```\n",
                    "num": "1-4",
                    "src": "::Représenter et manipuler::\n[markdown]\n**Représenter et manipuler**\nLes traitements possibles dépendent fortement des choix de représentation\n{T}\n\n::Quelles données ?::\n[markdown]\n**Quelles données ?**\nLa représentation numérique d'un livre peut inclure des données qui ne se limitent pas au contenu textuel. Donnez quelques exemples.\n{#### Le genre, la date de création, l'éditeur, ...}\n\n::De la variété ?::\n[markdown]\n**De la variété ?**\nIl n'existe qu'une seule façon de représenter numériquement un livre.\n{F #Représenter une information est le résultat de nombreux choix}\n\n::Comment choisir ?::\n[markdown]\n**Comment choisir ?**\nDonnez des exemples de critères qui peuvent gouverner le choix d'une représentation numérique.\n{#### la concision, la pertinence (permettre des traitements voulus), l'efficacité (les traitements sont réalisés rapidement, la confidentialité (l'accès aux données  peut être contrôlé),...}\n\n::Qui choisit ? ::\n[markdown]\n**Qui choisit ?**\nLes choix de représentations sont faits par\n{\n~Les informaticiens #non pas seuls car intervient aussi l'utilisation métier des objets représentés\n~Les experts métier #non pas seuls car il faut des spécialistes des données numériques et des algorithmes\n=Les deux #oui et souvent aussi des chercheurs, des entreprises, ...\n}\n",
                    "title": "Auto-évaluation"
                },
                {
                    "filename": "1-5activite_Activite.html",
                    "folder": "Activite",
                    "lastLine": "```\n",
                    "num": "1-5",
                    "src": "::Une tâche complexe::\n[markdown]\n**Une tâche complexe**\nReprésenter et normaliser est une tâche complexe : l'exemple de HTML. En vous rendant sur les pages wikipedia de [HTML](https://fr.wikipedia.org/wiki/Hypertext_Markup_Language) et du [W3C](https://fr.wikipedia.org/wiki/World_Wide_Web_Consortium). Répondez aux questions suivantes :\n- Quelle est l'origine de `HTML` ?\n- Qui développe et publie les spécifications `HTML` depuis 1995 ?\n- Quelle est la version la plus récente de `HTML` et son année de parution ?\n- Qui participe au développement du standard `HTML` au `W3C` ?\n- Quelles sont les étapes pour arriver à être une recommandation ?\n- Qui est responsable du standard `css` pour les feuilles de style ?\n{#### origine au CERN ; Le W3C développe le HTML depuis 1995 ; HTML5 en 2014 ; industriels, éditeurs logiciels, chercheurs, entreprises du Web, ... ; brouillon, appel, candidat, proposition et recommandation ; le W3C.}\n",
                    "title": "Activite"
                }
            ],
            "title": "Comment utiliser Esc@Pad pour produire un support de cours multi-plateformes"
        }
    ],
    "title": "Module de cours test 1"
}