{
    "author": "Freddy Limpens",
    "css": "http://culturenumerique.univ-lille3.fr/css/base.css",
    "ims_archive_path": "",
    "language": "fr",
    "menutitle": "Base de données",
    "module": "module1",
    "sections": [
        {
            "lastLine": "",
            "module": "module1",
            "num": "1",
            "subsections": [
                {
                    "filename": "1-1cours_webcontent.html",
                    "folder": "webcontent",
                    "num": "1-1",
                    "src": "\nDans cette séance nous allons aborder la notion de données en explorant tout d'abord le monde de l'open data et des possibilités que cette tendance apporte. Nous aborderons ensuite les premières notions de représentation des données avant d'introduire un outils permettant de les manipuler et de les visualiser.  \nLien prise de notes collective : https://oae.univ-lille3.fr/content/lille3/Ey6qIPD1g\n\n",
                    "title": "Cours",
                    "videos": []
                },
                {
                    "filename": "1-2notions-de-bases_webcontent.html",
                    "folder": "webcontent",
                    "lastLine": "## Collecter et représenter les données\n",
                    "num": "1-2",
                    "src": "\nUne base de données est un dispositif technologique permettant de stocker et récupérer des données brutes. Sur internet, les informations délivrées *aux clients* (votre navigateur) par un *serveur* (ceux de Facebook, Google, Lemonde.fr, Wikipedia.fr, etc.) proviennent toujours d'une base de données:  \n![](http://static.commentcamarche.net/www.commentcamarche.net/pictures/bdd-images-basecs.gif)  \n\n **Intermède participatif** : Les bases de données sont présentes partout. Donner des exemples de domaines d'activités où dont utilisés des DB et pour quel type de données.  \n  \nCette vision est cependant très schématique, le terme *\"base de données\"* étant très générique, car les bases de données sont maintenant organisés en des architectures très complexes et distribuées dans ce qu'on appelle le \"cloud computing\".\n\nMalgré ces évolutions récentes, une base de donnée reste définie par son modèle de données détaillant les liens entre ses éléments à l'aide de \"tableaux\", exactement comme ceux que vous manipuler dans un logiciel de feuille de calcul. On les appelle plus souvent \"tables\" dans le jargon. Une table peut représenter par exemple un aspect d'une \"entité\" du modèle ou une \"relation\" entre les différentes entités. C'est précisément l'exploitation et la manipulation de ces relations que permettent les bases de données dites \"relationnelles\", inventées dans les années 70:\n![](https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Relational_key_SVG.svg/300px-Relational_key_SVG.svg.png)  \nTout repose ici sur l'usage d'une \"clé unique\" qui identifie chaque entité (ici des personnes que l'on décrit à travers différentes tables: une pour l'identité, une autre pour les coordonnées téléphoniques).   \n\nLes bases de données relationnelles sont encore aujourd'hui incontournables et sont au coeur de nombreux logiciels très répandues comme WordPress, Drupal, WikiMedia, etc. et au coeur de nombreux sites web (libération.fr, tous les blogs, wikipedia.org, etc.). Cependant, de nouveaux formats et technologies de base de données sont apparues dans les années 90 afin d'optimiser la \"portabilité\" des données, c'est à dire le transfert aisé d'un serveur à un autre: XML, JSON, etc. Nous allons voir que ces formats de données plus statiques sont utilisés pour diffuser des données, dans un mouvement encore en plein essor l'OPEN DATA.\n\n",
                    "title": "Notions de bases",
                    "videos": []
                },
                {
                    "filename": "1-3collecter-et-representer-les-donnees_webcontent.html",
                    "folder": "webcontent",
                    "lastLine": "```comprehension\n",
                    "num": "1-3",
                    "src": "\n### Exemples de jeux de données\n\nExploration des différents jeux de données disponibles: sites institutionnels, opendata, etc. \n\n- [**Data.Gouv.Fr**](https://www.data.gouv.fr). Exemples:  \n- Répartition géographique des contribuables de l'Impot sur les grandes Fortunes [ISF en France](https://www.data.gouv.fr/fr/datasets/impot-de-solidarite-sur-la-fortune/)  \n- Résultats des élections: [Présidentielles 2012](https://www.data.gouv.fr/fr/datasets/election-presidentielle-2012-resultats-572126/), Départementales, etc.  \n \n- [Etude sur la consommation de traitements contre la dysfonction érectile](https://www.data.gouv.fr/fr/datasets/etude-sur-la-consommation-de-traitements-contre-la-dysfonction-erectile/)\n- [DataFrance](http://datafrance.info/?utm_source=datagouv&utm_medium=datagouv&utm_campaign=reuse-global)  \n- [**OPenData.EU**](https://open-data.europa.eu) \n- **Sncf**: https://ressources.data.sncf.com/explore/  \nExemples:[Satisfaction Clients dans les gares](https://ressources.data.sncf.com/explore/dataset/barometre-client/?tab=metas), [Pianos dans les gares](https://ressources.data.sncf.com/explore/dataset/gares-pianos/)  \n\n- **Nord - Pas de Calais** : http://opendata.nordpasdecalais.fr/  \ndonnnées \"sociales\" intéressantes par ex. [Développement Humain communal (IDH-4) pour l'année 2009](http://opendata.nordpasdecalais.fr/dataset/indicateur-de-developpement-humain-communal-idh-4-en-2009/resource/e0efab89-5e40-4d59-8b78-280a3edcff47)\n- **Ville d'Issy les Moulinaux** : https://data.issy.com  \n\n- [**INSEE**](http://www.insee.fr/fr/bases-de-donnees/): stat globales, données démographiques, stats économiques, etc.\n\n- Données \"citoyennes\" [NosDonnées.fr](http://www.nosdonnees.fr/dataset)\n\nDifférents formats sont utilisés dans le domaine de l'OpenData. NOus avons vu ensemble cette séance.\n\n### le .CSV (Comma Separated Value)\n\nC'est un format texte, i.e ouvrable dans n'importe quel bon éditeur texte puisqu'il n'inclue pas de mise en forme à la différence des formats   traitement de text (ODT, DOC, etc). Un fichier CSV est essentiellement un tableau dans lequel:\n\n- les valeurs pour les différentes colonnes sont séparés par un signe que l'on choisit la 1ère fois que l'on enregistre le fichier. Un conseil: éviter de choisir la `,` car en France c'est le signe qui sépare les décimales des nombres, donc il y a risque de se retrouver avec 2 colonnes différentes pour les entiers et le décimales d'un nombre à virgule, ex: 12,5 => 12 et 5 dans 2 colonnes séparées. Un signe couramment employé est le `;` ou la tabulation \n- la 1ère ligne donne le nom des colonnes  \n\n### le .XLS: \n\nLe format Excel pour un tableur est très diffusé. Attention il faut très souvent retraiter ce format et extraire les données des feuillets en autant de fichier .CSV pour une exploitation des données.\n\n### JSON\nle .JSON: c'est le format d'échange de données sur le Web par excellence. C'est un format texte utilisable par des \"machines\" qui sertà stocker les données sous forme \"d'objets\" ayant différents \"champs\" décrivant les propriétés de chaque item. La grande différence avec les tableaux c'est qu'un champ peut être décrit avec plusieurs \"sous-champs\", ce qui se traduit plus difficilement avec un tableau.  \n\nNous verrons par la suite d'autres formats courants, notamment ceux dédiés aux donnés géoréférencées.  \n\n",
                    "title": "Collecter et représenter les données",
                    "videos": []
                },
                {
                    "filename": "1-4auto-evaluation_Comprehension.html",
                    "folder": "Comprehension",
                    "lastLine": "```\n",
                    "num": "1-4",
                    "src": "\n::Format texte::[markdown]Parmis les formats de données suivants, lequel est un format texte, i.e lisible par un simple editeur de texte\n{\n~%50%JSON\n~%50%CSV\n~%-100%XLS\n}\n\n",
                    "title": "Auto-évaluation"
                },
                {
                    "filename": "1-5application-manipuler-les-donnees-avec-cartodb_webcontent.html",
                    "folder": "webcontent",
                    "lastLine": "## Exercice sur machine\n",
                    "num": "1-5",
                    "src": "\n[Préparer un CSV pour CartoDB](https://player.vimeo.com/video/100105203){: .lien_video }\n\nRegarder ce tutoriel [Préparer un CSV pour CartoDB](https://player.vimeo.com/video/100105203)\n sur l'utilisation de la plateforme [CartoDB.com](https://cartodb.com/)\n\n",
                    "title": "Application : Manipuler les données avec CartoDB",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/100105203",
                            "video_thumbnail": "https://i.vimeocdn.com/video/536038298_640.jpg",
                            "video_title": "Préparer un CSV pour CartoDB"
                        }
                    ]
                },
                {
                    "filename": "1-6exercice-sur-machine_webcontent.html",
                    "folder": "webcontent",
                    "lastLine": "```activite\n",
                    "num": "1-6",
                    "src": "\nSuivez les étapes ci-dessous et répondez aux questions ci-après.\n\n- aller suur cartodb.com\n- se creer un compte\n- aller sur https://ressources.data.sncf.com\n- récupérer le jeu de données \"Baromètre satisfaction client en gare\"\n- ouvrir le fichier excel, récupérer (c/c) les valeurs des 2 colonnes : nom de la gare, valeur de satisfaction globale\n- créer un fichier csv et y coller ces 2 col. \n- récupérer le fichier \"referentiel gare voyageurs\" sur data.sncf.com\n- normalement le fichier est géocodé par rapport à la colonne \"commune\", sinon, le faire manuellement en cliquant sur le bouton orange \"geo\" a côté de la colonne the_geom\n- opérer la fusion des 2 datasets ainsi créés en choisissant pour chaque jeus de données la colonne donnant le nom des gares\n- une fois la fusion effectuée, faite la requête SQL permettant de ne voir que les gares qui ont un chiffre de satisfaction:  \n`\nSELECT * FROM voyageurs_merge WHERE satisfaction_globale IS NOT NULL\n`\n",
                    "title": "Exercice sur machine",
                    "videos": []
                },
                {
                    "filename": "1-7activite_Activite.html",
                    "folder": "Activite",
                    "lastLine": "```\n",
                    "num": "1-7",
                    "src": "::Questions::[markdown] Après avoir effectué le TP précédent, répondez aux questions suivantes:\n- Renseignez le lien vers la cartographie que vous avez réalisée, puis répondez aux questions suivantes:\n- Trouver des représentations qui permettent de visualiser instantanément les gares ayant le meilleure indice de satisfaction. inspecter les résultat, et compter combien de résultats sont affichés par rapport aux nombres de gares pour lesquelles vous avez un chiffre de satisfaction. \n- Que constatez-vous ? Pourquoi ? (aidez-vous de requêtes SQL pour compter les résultats)\n{}\n",
                    "title": "Activite"
                }
            ],
            "title": "Séance 1. (2x2h) Collecter et Manipuler des données"
        }
    ],
    "title": "Introduction aux bases de données et Datajournalisme"
}